In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('C:/Users/power/Downloads/heightwithgender.csv')
df.head()

  gender     height
0   Male  73.847017
1   Male  68.781904
2   Male  74.110105
3   Male  71.730978
4   Male  69.881796

In [4]:
df.shape

(10000, 2)

In [6]:
df.describe()

             height
count  10000.000000
mean      66.367560
std        3.847528
min       54.263133
25%       63.505620
50%       66.318070
75%       69.174262
max       78.998742

In [7]:
df.height.mean()

66.367559754866

In [8]:
df.height.std()

3.847528120795573

#### Using 3 standard deviation for remove outlier

In [9]:
upper_limit = df.height.mean() + 3*df.height.std()
upper_limit

77.91014411725271

In [11]:
lower_limit = df.height.mean() - 3*df.height.std()
lower_limit

54.824975392479274

In [12]:
df[(df.height > upper_limit) | (df.height < lower_limit)]

      gender     height
994     Male  78.095867
1317    Male  78.462053
2014    Male  78.998742
3285    Male  78.528210
3757    Male  78.621374
6624  Female  54.616858
9285  Female  54.263133

In [24]:
no_outlier_df_by_std = df[(df.height < upper_limit) & (df.height > lower_limit)]
no_outlier_df_by_std

      gender     height   Z Score
0       Male  73.847017  1.943964
1       Male  68.781904  0.627505
2       Male  74.110105  2.012343
3       Male  71.730978  1.393991
4       Male  69.881796  0.913375
...      ...        ...       ...
9995  Female  66.172652 -0.050658
9996  Female  67.067155  0.181830
9997  Female  63.867992 -0.649655
9998  Female  69.034243  0.693090
9999  Female  61.944246 -1.149651

[9993 rows x 3 columns]

In [25]:
df.shape[0] - no_outlier_df_by_std.shape[0]

7

That say the number of removed outlier from actual data is 7

shape[0] means row, shape[1] means column

## Z Score

It is similar to standard deviation we can use both for remove outlier

Z score indicate how many standard deviation away a data point

#### Calculate Z-Score

Z = (x - µ) / ८

µ = mean
८ = standard deviation

In [19]:
df['Z Score'] = (df.height - df.height.mean()) / df.height.std()
df.head(5)

  gender     height   Z Score
0   Male  73.847017  1.943964
1   Male  68.781904  0.627505
2   Male  74.110105  2.012343
3   Male  71.730978  1.393991
4   Male  69.881796  0.913375

In [20]:
df[df['Z Score'] > 3]

     gender     height   Z Score
994    Male  78.095867  3.048271
1317   Male  78.462053  3.143445
2014   Male  78.998742  3.282934
3285   Male  78.528210  3.160640
3757   Male  78.621374  3.184854

In [21]:
df[df['Z Score'] < -3]

      gender     height   Z Score
6624  Female  54.616858 -3.054091
9285  Female  54.263133 -3.146027

In [28]:
no_outlier_df_by_zscore = df[(df['Z Score'] < 3) & (df['Z Score'] > -3)]
no_outlier_df_by_zscore

      gender     height   Z Score
0       Male  73.847017  1.943964
1       Male  68.781904  0.627505
2       Male  74.110105  2.012343
3       Male  71.730978  1.393991
4       Male  69.881796  0.913375
...      ...        ...       ...
9995  Female  66.172652 -0.050658
9996  Female  67.067155  0.181830
9997  Female  63.867992 -0.649655
9998  Female  69.034243  0.693090
9999  Female  61.944246 -1.149651

[9993 rows x 3 columns]

In [29]:
df.shape[0] - no_outlier_df_by_zscore.shape[0]

7